# St7GetEntitySetVisibility

Determines the visibility of an entity set within the model window.

long St7GetEntitySetVisibility(long uID, long SetNum, bool* Visible)
Input Parameters
uID
Strand7 model file ID.
SetNum
The entity set number.
Output Parameters
Visible
Visible state; either True or False.